Autodesk.Revit.DB.WallLocationLine
This enumerated type represents the options for alignment of a wall's location line.
Since:
2011

Autodesk.Revit.DB.WallLocationLine.CoreInterior
The wall location line is aligned to the exterior face of the core.

Autodesk.Revit.DB.WallLocationLine.CoreExterior
The wall location line is aligned to the exterior face of the core.

Autodesk.Revit.DB.WallLocationLine.FinishFaceInterior
The wall location line is aligned to the interior face of the wall.

Autodesk.Revit.DB.WallLocationLine.FinishFaceExterior
The wall location line is aligned to the exterior face of the wall.

Autodesk.Revit.DB.WallLocationLine.CoreCenterline
The wall location line is aligned to the center of the core.

Autodesk.Revit.DB.WallLocationLine.WallCenterline
The wall location line is aligned to the center of the wall.